tap "cormacrelf/tap"
tap "dopplerhq/cli"
tap "felixkratz/formulae"
tap "heroku/brew"
tap "leoafarias/fvm"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
# General-purpose data compression with high compression ratio
brew "xz"
# Password hashing library and CLI utility
brew "argon2"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# Ruby environment tool
brew "chruby"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# CPU usage limiter
brew "cpulimit"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Automatic git commit --fixup
brew "git-absorb"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Audit git repos for secrets
brew "gitleaks"
# Library for command-line editing
brew "readline"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Kubernetes package manager
brew "helm"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Portable Foreign Function Interface library
brew "libffi"
# Postgres C API library
brew "libpq"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Command-line client for OpenStack
brew "openstackclient"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Theme for zsh
brew "powerlevel10k"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Plugin manager for tmux
brew "tpm"
# Image processing library
brew "vips"
# Executes a program periodically, showing output fullscreen
brew "watch"
# JavaScript package manager
brew "yarn"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Better and friendly vi(vim) mode plugin for ZSH
brew "zsh-vi-mode"
# Watcher for macOS 10.14+ light/dark mode changes
brew "cormacrelf/tap/dark-notify"
# The official Doppler CLI for managing your secrets
brew "dopplerhq/cli/doppler"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Simple cli to manage Flutter SDK versions per project
brew "leoafarias/fvm/fvm"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Tools for building Android applications
cask "android-studio"
# Chromium based browser
cask "arc"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Web browser with integrated AI assistant
cask "comet"
# Voice and text chat software
cask "discord"
cask "font-source-code-pro-for-powerline"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# GPU-based terminal emulator
cask "kitty"
# Neovim Client
cask "neovide-app"
# Collaboration platform for API development
cask "postman"
# Ruby on Rails IDE
cask "rubymine"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@17"
# Open-source code editor
cask "visual-studio-code"
mas "AdGuard for Safari", id: 1440147259
mas "Numbers", id: 409203825
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "ahmadawais.shades-of-purple"
vscode "aki77.rails-db-schema"
vscode "alexisvt.flutter-snippets"
vscode "bbenoist.nix"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "bungcip.better-toml"
vscode "castwide.solargraph"
vscode "catppuccin.catppuccin-vsc"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "decaycs.decay"
vscode "enkia.tokyo-night"
vscode "felixangelov.bloc"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.auto-rename-tag"
vscode "get-snippets.get-snippets"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hridoy.rails-snippets"
vscode "ibm.output-colorizer"
vscode "jdinhlife.gruvbox"
vscode "jebbs.plantuml"
vscode "jwsandeman.cyberpunk2077-theme"
vscode "kaiwood.endwise"
vscode "lucax88x.codeacejumper"
vscode "mikestead.dotenv"
vscode "msnilshartmann.blue-light"
vscode "mvllow.rose-pine"
vscode "naumovs.color-highlight"
vscode "ninoseki.vscode-gem-lens"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "pegleg.codachi"
vscode "pkief.material-icon-theme"
vscode "rebornix.ruby"
vscode "redhat.vscode-yaml"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "stepanvanzuriak.mono"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "vincaslt.highlight-matching-tag"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "wayou.vscode-todo-highlight"
vscode "wingrunr21.vscode-ruby"
