tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "osx-cross/arm"
tap "osx-cross/avr"
# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Ruby environment tool
brew "chruby"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Audit git repos for secrets
brew "gitleaks"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Improved top (interactive process viewer)
brew "htop"
# Lightweight and flexible command-line JSON processor
brew "jq"
# User-friendly front-end to ssh-agent(1)
brew "keychain"
# Mac App Store command-line interface
brew "mas"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Theme for zsh
brew "powerlevel10k"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Tools for building Android applications
cask "android-studio"
# Chromium based browser
cask "arc"
cask "font-source-code-pro-for-powerline"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Keyboard customiser
cask "karabiner-elements"
# Neovim Client
cask "neovide-app"
# Ruby on Rails IDE
cask "rubymine"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
mas "AdGuard for Safari", id: 1440147259
mas "Xcode", id: 497799835
vscode "aaron-bond.better-comments"
vscode "ahmadawais.shades-of-purple"
vscode "aki77.rails-db-schema"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "bungcip.better-toml"
vscode "castwide.solargraph"
vscode "dart-code.dart-code"
vscode "dart-code.flutter"
vscode "formulahendry.auto-rename-tag"
vscode "hridoy.rails-snippets"
vscode "ibm.output-colorizer"
vscode "jebbs.plantuml"
vscode "kaiwood.endwise"
vscode "lucax88x.codeacejumper"
vscode "mikestead.dotenv"
vscode "naumovs.color-highlight"
vscode "ninoseki.vscode-gem-lens"
vscode "octref.vetur"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "rebornix.ruby"
vscode "redhat.vscode-yaml"
vscode "sianglim.slim"
vscode "svelte.svelte-vscode"
vscode "vincaslt.highlight-matching-tag"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "wingrunr21.vscode-ruby"
